tap "homebrew/bundle"
tap "homebrew/core"

# taps richard lehane's digipres to install siegfried
tap "richardlehane/digipres"

# installs afflib, Advanced Forensic Format
brew "afflib"

#installs antiword, a utility to read Word (.doc) files
brew "antiword"

# installs bulk_extractor, a stream-based forensics tool
brew "bulk_extractor"

# installs cdparanoia, an audio extraction tool for sampling CDs
brew "cdparanoia"

# installs cdrdao, to record CDs in Disk-At-Once mode
brew "cdrdao"

#installs clamav, Anti-virus software (note: additional set up required)
brew "clamav"

#installs coreutils, basic file, shell and text manipulation utilities of the GNU operating system
brew "coreutils"

# installs ddrescue, a GNU data recovery tool
brew "ddrescue"

#installs disktype, to detect content format of a disk or disk image
brew "disktype"

#installs duff, to quickly find duplicates in a set of files from the command-line 
brew "duff"

# installs fdupes, to identify or delete duplicate files
brew "fdupes"

# installs findutils, a collection of GNU find, xargs, and locate
brew "findutils"

# installs git, a distributed revision control system
brew "git"

#installs gnu-tar, a GNU version of the tar archiving utility
brew "gnu-tar"

# installs libarchive, a multi-format archive and compression library
brew "libarchive"

# installs libwef, library for support of the Expert Witness Compression Format
brew "libewf"

# installs sleuthkit, forensic toolkit
brew "sleuthkit"

# installs tree, to display directories as trees (with optional color/HTML output) (req for brunnhilde)
brew "tree"

# installs twarc, a command-line tool and Python library for archiving Twitter JSON
brew "twarc"

# installs siegfried, a signature-based file identification tool
brew "richardlehane/digipres/siegfried"

# installs youtube-dl, to download YouTube videos from the command-line
brew "youtube-dl"
